---
kind: enumMember
id: F:Autodesk.Revit.DB.Infrastructure.HorizontalCurveType.Spiral
enum: Autodesk.Revit.DB.Infrastructure.HorizontalCurveType
source: html/786ce1c0-79de-428d-136f-265dc4cffe78.htm
---
# Autodesk.Revit.DB.Infrastructure.HorizontalCurveType.Spiral

Spiral curve type.